#version: 0.2
e r
t i
e n
a r
o n
f i
ti on
e m
fi er
I d
ti fier
en tifier
Id entifier
s s
en t
e ss
er a
em ent
ar y
ar a
m e
D e
l e
O p
Op era
i a
b le
V ar
c l
ara tion
De cl
ia ble
Var iable
Decl aration
Variable Declaration
a me
N ame
A c
Ac c
Acc ess
p e
T y
Ty pe
Type Name
E l
ement ary
El ementary
Elementary TypeName
L i
o r
t or
Opera tor
a t
em b
M emb
Memb er
Member Access
S t
E x
i on
r ess
p ress
Ex press
Express ion
St at
Stat ement
u n
c tion
F un
Fun ction
a l
i n
C al
Cal l
Function Call
ary Opera
aryOpera tion
B in
Bin aryOperation
Li t
era l
Lit eral
Expression Statement
I n
d e
x Access
In de
Inde xAccess
t er
s t
P ara
me ter
Para meter
Li st
Parameter List
fi n
De fin
o c
A ss
i g
m ent
ig n
Ass ign
Assign ment
p le
T u
ple Expression
Tu pleExpression
l oc
loc k
B lock
i tion
Defin ition
VariableDeclaration Statement
Function Definition
e t
u r
ur n
R et
Ret urn
I f
If Statement
d er
i t
e d
U s
Us er
Defin ed
User Defined
UserDefined TypeName
en der
S ender
= =
l it
i s
i b
V is
i lit
ib ilit
Vis ibilit
Visibilit y
M a
in g
p p
Ma pp
Mapp ing
P r
at e
i v
Pr iv
Priv ate
o d
M od
i fier
Mod ifier
ElementaryTypeName Expression
! =
a n
i c
C an
on ic
al Name
Can onic
Canonic alName
& &
l a
P la
c t
r u
St ru
Stru ct
Struct Definition
> =
o l
at a
U n
Un aryOperation
s et
ata set
ataset s
c e
a tion
In v
ol der
oc ation
Modifier Inv
ModifierInv ocation
h older
Pla ce
holder Statement
Place holderStatement
Modifier Definition
< =
d atasets
E v
Ev ent
D datasets
Event Definition
+ =
n al
Ex ter
Exter nal
m it
E mit
Emit Statement
r a
+ +
| |
A r
y TypeName
ra yTypeName
Ar rayTypeName
o un
R oun
Roun d
y er
Pla yer
l y
in e
l ine
emb ly
In line
Ass embly
Inline Assembly
E n
u m
En um
* *
u e
V al
Enum Val
EnumVal ue
F or
For Statement
Player Round
PlayerRound s
C on
Return s
Event Returns
o t
i le
W h
ile Statement
Wh ileStatement
S p
P ot
Sp lit
Pot Split
e e
e a
d ition
Con dition
Condition al
F ee
e w
- =
N ew
New Expression
o w
D atasets
t e
H M
O HM
OHM O
T ea
Tea m
r ow
o s
e s
Team Fee
< <
Enum Definition
S datasets
Con t
a g
l er
T h
De le
R e
R Sdatasets
Dele te
Th row
D ata
T r
O OHMO
P OOHMO
Cont r
o k
Stat e
ag e
C K
P CK
PCK datasets
T ok
Tok en
ar d
G en
a le
K ler
Kler os
oc ol
is Pr
ot ocol
es isPr
Gen esisPr
GenesisPr otocol
B r
ea k
Br eak
ia n
G u
ard ian
Gu ardian
ib u
L Ddatasets
c h
p os
POOHMO Datasets
P o
Po ol
| =
G ame
Tr ee
Contr ibu
a s
u l
T K
b it
S tor
Stor age
y n
> >
Guardian Storage
Pr es
Pres ale
h e
f o
In fo
ti n
- -
i st
ist r
St a
an s
as e
n e
F s
Fs TK
Tr ans
Contribu tor
Pr o
Re g
E T
ol ler
Contr oller
D A
pos al
FsTK Token
Pro posal
A S
M ul
P OHMO
T AS
ET S
DA TAS
Mul ti
POHMO DATAS
POHMODATAS ETS
X Datasets
POOHMO XDatasets
ti c
Presale Pool
Reg istr
B ase
a ction
Trans action
l o
Ar bit
Arbit ra
O ne
in t
an ce
D is
S ch
t he
tin g
p u
fi g
Con fig
Dis pu
Dispu te
u s
I ss
S yn
u ance
x State
ti xState
the tixState
Iss uance
Syn thetixState
Issuance Data
O r
f f
s tic
ti stic
der Sta
Or derSta
tistic Tree
OrderSta tisticTree
B ig
One Data
Big OneData
Li mit
u le
Stat us
u ff
Acc oun
P er
n ag
Ma nag
Manag er
c k
d s
ic e
i od
em e
Sch eme
Per iod
S et
V ot
Vot e
ti tion
ra ct
Cont ract
E I
L o
Lo g
i d
uff er
o de
i l
F F
F Datasets
Li b
EI FDatasets
FF EIFDatasets
T ru
q u
Li qu
Liqu id
/ =
Mod ule
Registr y
G lo
b al
st ra
Con stra
Re c
Glo bal
Constra int
Global Constraint
A u
Au ction
Arbitra ble
De pos
Depos it
Accoun t
M ess
Mess age
K e
Z a
i x
y Datasets
yn ix
Ke yDatasets
Za ynix
Zaynix KeyDatasets
L O
L datasets
r y
u t
LO Ldatasets
In st
P datasets
R Pdatasets
W al
le t
Limit Manager
Set ting
Wal let
Fee Pool
Fee Period
Kleros Liquid
D ice
C row
D i
e ct
r ect
De bit
ds ale
Crow dsale
Di rect
Direct Debit
GuardianStorage Config
ple Arbitrable
Multi pleArbitrable
MultipleArbitrable Transaction
C a
R o
Module Registry
Ro le
Sta k
er s
C he
l ion
il lion
Che ck
N ode
e lo
v e
Con tin
Tru elo
Contin ue
Truelo ve
Arbitra tor
Guardian Info
p ar
Re par
ul t
Repar tition
Proposal State
a i
o int
p oint
t ry
En try
Check point
A l
A p
V o
pe al
Stak er
Ap peal
Vo ter
B et
g e
Rec on
ch an
C o
Registr ation
loc ation
Token Al
TokenAl location
Ex chan
Exchan ge
Setting s
M in
la yer
Re layer
Recon Lib
B uffer
b uffer
C oun
Parameter s
W in
Contributor Data
D ai
F Sdatasets
u p
Contribu tion
Dai ly
B ut
t on
ru ment
Presale Lib
Inst rument
But ton
F ra
V a
Fra ction
Va ult
A d
M illion
l i
S or
S um
Vote Coun
tition Sum
Sor titionSum
VoteCoun ter
SortitionSum Tree
C h
S e
l Base
ed Crowdsale
an ne
Game Ch
Se edCrowdsale
anne lBase
GameCh annelBase
SeedCrowdsale Contract
R ew
d ing
ce iv
Re ceiv
TK N
Min ter
Rew ard
I SynthetixState
Var s
un d
Accoun ting
d ress
p li
istr ibu
Multi pli
Ad dress
0 0
P ar
B o
H an
I b
a ign
a Multi
f und
m p
s ig
fi c
St age
Re fund
Ca mp
Ib aMulti
Refund Vault
Camp aign
IbaMulti sig
t h
1 00
L u
a Dice
en ding
Inst aDice
Lu ck
I t
L ed
g er
Role s
It em
Led ger
B an
M ode
P ok
V i
i p
o Pok
de oPok
st le
Ca stle
Ban k
Vi deoPok
VideoPok er
an t
tic ip
Par ticip
Particip ant
C lock
D istribu
i z
o on
ed ule
Sch edule
Contract Receiv
ContractReceiv er
* =
F a
s Repartition
st Wallet
Dispute State
Tru stWallet
Truelove Base
Repartition Stage
Appeal sRepartition
Fa c
AppealsRepartition ed
H older
DirectDebit Info
E th
N in
P ending
S h
j a
or d
Multipli ers
Nin ja
C er
c row
ti fic
era Token
st ate
Round Setting
Truelove Registration
Daily Limit
Bank eraToken
Cer tific
Certific ation
D ut
M on
t o
ur t
ch Exchange
Dispute Status
Co urt
Dut chExchange
P in
S m
S n
a k
a il
ar t
uff le
Contribution Reward
Distribu tion
Sh uffle
Pin ak
Sm art
Sn ail
Pinak ion
B urn
T x
Game Base
Co in
Relayer Config
Relayer Module
up GameBase
Burn upGameBase
C ry
F ile
p to
Pr ic
Player Bo
Log File
Dice Luck
Address Set
Cry pto
Pric ing
PlayerBo ok
a ble
C ent
E s
M oon
T w
o Coin
r al
s One
u tion
ed Arbitrator
Dispute Struct
Auction Base
Button Base
Button Campaign
Clock AuctionBase
iz edArbitrator
Cent ral
Es crow
Moon Game
Tw oCoin
sOne MoonGame
Central izedArbitrator
TwoCoin sOneMoonGame
. _
B illion
C O
C up
P ur
R ate
ch ase
Rec ord
Smart Billion
Pur chase
SmartBillion s
Purchase Record
e Pricing
tor y
Inv ers
Exchange Rate
Contribution Proposal
SortitionSumTree Fac
Mode l
Invers ePricing
ExchangeRate s
SortitionSumTreeFac tory
B ar
I r
M or
g age
t gage
on Han
ow n
Ir onHan
Mor tgage
IronHan ds
C ol
H as
O f
d Wallet
g ress
l ice
r ing
s lice
y Game
ar ch
Ac tion
St ring
Con gress
Sp ent
es ting
Game Status
FsTK Col
LimitManager Config
Daily Spent
Mon arch
String s
FsTKCol dWallet
Monarch yGame
J ur
c ution
e cution
Ex ecution
Multi own
Pending State
Jur or
Execution State
Multiown ed
A N
B AN
D b
F l
M at
a ce
f er
f ace
er Auction
In ter
PlayerRound Data
ow erAuction
Certification Db
BAN K
Fl owerAuction
Mat h
Inter face
Th e
M S
m as
o m
er y
Castle Token
MS Fun
S u
V ers
d ler
er ic
is ter
pp ly
Gen eric
Reg ister
Contract Vers
GlobalConstraint Register
Deposit e
Han dler
Schedule Data
Eth er
Su pply
Generic Crowdsale
ContractVers ion
Supply Schedule
f t
i ss
i ft
m iss
x mas
ion List
Per miss
Arbitrable Permiss
Crypto xmas
ArbitrablePermiss ionList
Cryptoxmas Escrow
M e
it y
Ninja Token
B al
E R
I N
R ig
R ea
h t
q ue
s on
de d
ur e
Struct ure
En ded
Re que
Game Settings
Info Structure
ance InfoStructure
Appeal Dispute
Appeal able
Registration Rig
Address Bal
DailyLimit Vars
CO IN
Mortgage Manager
Has DailyLimit
ER C
Rea son
Reque st
Appealable Arbitrator
RegistrationRig ht
AddressBal anceInfoStructure
Reason Ended
L or
P h
t a
Lit e
ds Of
Shuffle Lite
Snail s
The Snails
Ether ShuffleLite
Lor dsOf
Ph ase
LordsOf TheSnails
T i
g Liquid
n gLiquid
era ngLiquid
De al
Stat s
Manager Config
Bo om
erangLiquid ity
Deal er
Boom erangLiquidity
M ar
S ai
W ar
i Me
Tu b
Game State
Dice Game
Bet tor
Min iMe
Sai Tub
MiniMe Token
O ut
o v
Dele g
Registr ar
Rec ov
Checkpoint Storage
SortitionSumTree s
Out Luck
Recov ery
G ift
S er
V esting
v ice
v esting
at o
Pot ato
Transaction State
Transaction Info
Pending TransactionState
Ser vice
Vesting Handler
vesting ContractVersion
A t
B en
C H
D ia
D oc
E the
K O
L a
O COIN
O KO
Y OKO
e fic
m on
m oon
n Status
r ans
t rans
u ment
y Pool
ar s
me Mode
cl iz
St ars
al Deposit
In Struct
st Deposit
Token Trans
ult yPool
Multipli er
Fac ultyPool
Eth moon
Tx nStatus
Crypto Stars
fer InStruct
ta ck
Ti meMode
At tack
Ben efic
CH OCOIN
Dia mon
Doc ument
Ethe alDeposit
La stDeposit
YOKO CHOCOIN
trans ferInStruct
cliz e
TokenTrans fer
Ethmoon V
Benefic i
Diamon d
Document Status
LastDeposit Info
2 2
C ard
I CO
ing Contract
Inv es
Proposal Data
Base ICO
Receiv ingContract
22 3
Inves tor
C ate
M ig
S ale
U p
g or
g ra
k er
Call Phase
Ma ker
oun t
GlobalConstraint Interface
Item Status
Cate gor
Sale State
Up gra
Categor y
Upgra de
K ing
L ord
O ra
R es
k et
o i
t In
fi tIn
Player Team
Cont ag
Tr oi
Token s
Token Interface
Pro p
Pro fitIn
Check Res
Recon TokenInterface
Item Token
Mon th
Snail Troi
Of Tokens
Mar ket
War OfTokens
Attack Info
Contag ion
ProfitIn Month
CheckRes ult
B J
B j
H er
L ender
L ending
T e
W or
d istribu
d Cup
l iv
l dCup
m in
t y
De liv
tor Handler
tor ContractVersion
Deposit Bank
Stak ing
Truelove Deliv
Coun t
Ad min
Distribu torHandler
Has DistributorHandler
Deleg ate
Gift Type
clize C
Ora clizeC
BJ J
Bj Te
Wor ldCup
distribu torContractVersion
TrueloveDeliv ery
BjTe st
WorldCup Token
& =
2 0
F li
F ift
c ount
y Fli
St ation
Dis count
Scheme Registrar
GlobalConstraint Registrar
Request able
Recovery Manager
Recovery ManagerConfig
Service Station
Benefici ary
Upgrade Scheme
Fift yFli
FiftyFli p
1 2
7 12
A L
B O
B u
B id
C D
D a
D om
E N
L on
L ET
N Y
N ation
N es
O ff
P EN
W W
W AL
a in
m Clock
n er
r ia
ar mClock
at us
st atus
User Token
Guardian Manager
Guardian ManagerConfig
EI P
il ding
Liquid Lon
Deposit Count
Al armClock
Exchange Service
Win ner
Par ty
Clock Struct
crow ExchangeService
The War
Mar ria
Deleg able
TokenTransfer Config
Delegate Log
BO X
Bu ilding
CD P
Da pp
Dom ain
Nes crowExchangeService
Off er
PEN NY
WAL LET
status Enum
LiquidLon g
Marria ge
Building Status
B on
C E
C e
C v
E t
F r
F datasets
L an
R ol
S y
T ra
b et
c Mig
d Market
g ine
i es
l l
r ation
s Escrow
ar ies
ol ution
ra tor
En gine
ee Ce
Token Category
Status es
Eth Rol
Smart olution
ta b
Benefici aries
Mig ration
Category Id
Her o
BJJ tab
Bon us
CE O
Cv cMig
Et Hero
Fr eeCe
Lan dMarket
Sy sEscrow
Tra der
bet Info
EthRol l
Smartolution Interface
CvcMig rator
FreeCe ll
C u
D x
K y
a clize
b er
y ed
De la
or aclize
st od
is m
Pr ice
Pot Potato
DA O
Set Stak
Auction State
chan ism
Sh ot
Pricing Me
Ether Shot
Ti er
Card Type
Market Maker
Cu stod
Dx MarketMaker
Ky ber
yed SetStak
Dela yedSetStak
oraclize State
Price Tier
PricingMe chanism
Custod ian
Kyber DxMarketMaker
DelayedSetStak e
B Y
B l
C Proposal
G CProposal
H is
I M
N ity
P L
R ed
S IM
T o
U to
a m
i um
p ium
s Base
ss Coin
ra und
ue Nation
Game V
ET Her
Scheme Proposal
00 1
Attack Log
Card sBase
ount Bonus
Upgrade Proposal
BJJ raund
WW W
TheWar Bl
TheWar Red
Dapp Manager
Dapp ManagerConfig
SIM PL
To ssCoin
Uto pium
am ountBonus
ETHer Nity
BJJraund His
TheWarBl ueNation
TheWarRed Nation
amountBonus Struct
F R
G or
K il
O W
W it
a Kil
d ra
d own
g on
h dra
m ment
p y
x Account
er ty
ter Co
lock ed
Un locked
Player Co
Token FR
Token OW
mas terCo
Request Type
Prop erty
Count down
Delegate Mode
Bonus Mode
Gor gon
Wit hdra
aKil ler
py Countdown
Unlocked Token
PlayerCo mment
TokenFR T
TokenOW L
masterCo pyCountdown
Gorgon aKiller
Withdra w
masterCopyCountdown Type
